30V/10Angle/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 -1 -2 0 0 0 0];

internalField uniform 1;

boundaryField {
    inlet {
        type fixedValue;
        value uniform 1;
    }

    outlet {
        type zeroGradient;
    }

    bottom {
        type slip;
    }

    top {
        type slip;
    }

    obstacle {
        type zeroGradient;
    }

    defaultFaces {
        type empty;
    }
}

// ************************************************************************* //